---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInAnotherDesignOption
source: html/77718024-4615-f16d-2235-0fc732baf9d7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingSweepByElementsInAnotherDesignOption Property

A sweep in a Design Option cannot be hosted by an element in another Design Option [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingSweepByElementsInAnotherDesignOption { get; }
```